In [5]:
import numpy as np
import pandas as pd

In [8]:
df1=pd.DataFrame({'A':[1,2,3],'B':[4,5,6]}, index=[19,20,21])
df2=pd.DataFrame({'A':['a','b','c'],'B':['d','e','f']}, index=[20,21,22])

In [7]:
df1

    A  B
20  a  d
21  b  e
22  c  f

df2

In [9]:
df2

    A  B
20  a  d
21  b  e
22  c  f

In [10]:
df1

    A  B
19  1  4
20  2  5
21  3  6